app/controllers/admin/menu_items_controller.rb

SELECT * FROM `menu_items` WHERE (`menu_items`.parent_id = 1) ORDER BY position
---
  def index
    @menu_items = MenuItem.find(:all, :conditions => 'parent_id IS NULL')

SELECT * FROM `menu_items` WHERE (`menu_items`.parent_id = 1) ORDER BY position
---
  def edit
    @menu_item = MenuItem.find(params[:id])

SELECT * FROM `menu_items` WHERE (parent_id) ORDER BY position DESC LIMIT 1
INSERT INTO `menu_items` (`position`, `label`, `created_at`, `updated_at`, `page_id`, `url`, `parent_id`) VALUES(1, 'Main Menu', '2009-10-28 19:10:12', '2009-10-28 19:10:12', '', '', NULL)
---
  def create
    begin
      @parent = MenuItem.find(params[:menu_item][:parent_id])
      @menu_item = @parent.children.new(params[:menu_item])
    rescue ActiveRecord::RecordNotFound => e
      @menu_item = MenuItem.new(params[:menu_item])
    end

    if @menu_item.save

SELECT * FROM `menu_items` WHERE (`menu_items`.`id` = 14)
UPDATE `menu_items` SET `updated_at` = '2009-10-28 20:12:54', `label` = 'County Public Record Sites' WHERE `id` = 14
---
  def update
    @menu_item = MenuItem.find(params[:id])

    respond_to do |format|
      if @menu_item.update_attributes(params[:menu_item])

SELECT * FROM `menu_items` WHERE (`menu_items`.parent_id = 1) ORDER BY position
UPDATE `menu_items` SET `updated_at` = '2009-10-28 19:55:55', `position` = 3 WHERE `id` = 3
---
  def sort
    @menu_item = MenuItem.find(params[:id])
    @menu_item.children.each do |child|
      child.position = params['menu-item-list'].index(child.id.to_s) + 1
      child.save