app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` ORDER BY id ASC
---
  def index
    field = params[:field]
    direction = params[:direction]
    @pages = Page.sort(field, direction).paginate :page => params[:page], :per_page => 10, :order => 'title ASC'

INSERT INTO `pages` (`created_at`, `title`, `url_tag`, `published`, `updated_at`, `version`, `content`, `html_title`, `description`, `keywords`) VALUES('2009-10-28 19:38:55', 'About Our Company', 'about-us', 1, '2009-10-28 19:38:55', 1, '<h2>Ohio Realty Group</h2>\r\n<p>320 E. Main Street<br />\r\nRavenna, OH 44266<br />\r\nOffice - 330-296-9000<br />\r\nFax - 330-297-8723</p>\r\n<p>Ohio Realty Group serves Summit and Portage Counties as well as parts of Stark and Medina Counties.</p>\r\n<p>We have many qualified, active Sales Associates. Many holding professional designations such as CRS (Certified Residential Specialist), ABR (Accredited Buyer Representative), and CSP (Certified Sales Professional).</p>\r\n<p>We have several Sales Associates who have been recognized internationally for their sales production.</p>\r\n<p>Ohio Realty Group is conveniently located in Ravenna, Ohio, which is the County Seat of Portage county and allows for easy access to Summit and Stark Counties.</p>\r\n<p><img width=\"140\" height=\"113\" border=\"0\" src=\"/images/ohio_reality_logo_low_res.jpg\" alt=\"\" /></p>', 'About Our Company', '', '')
---
  def create
    @page = Page.new(params[:page])

    if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def update
    @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def show_form
    begin
      @page = Page.find(params[:id])