app/controllers/main_controller.rb

  def content_page

    @page = Page.find_by_url_tag(params[:path])
---
SELECT * FROM `pages` WHERE (`pages`.`url_tag` IN ('images','ohio_reality_banner.jpg')) LIMIT 1